src/Enums/ТипШтрихкода/ТипШтрихкода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипШтрихкода</name>
  <enumValues>
    <name>DataMatrix</name>
    <comment>Двумерный штрихкод, содержит GTIN.</comment>
  </enumValues>
  <enumValues>
    <name>ТШК</name>
    <comment>Линейный штрихкод, представляет номер короба.</comment>
  </enumValues>
</mdclass:Enum>

src/CommonModules/ОбработкаШтрихкодовКлиентСервер/Module.bsl
// @strict-types
#Область ПрограммныйИнтерфейс

// Функция определяет тип штрихкода.
// 
// Параметры:
//  Штрихкод - Строка - Штрихкод
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипШтрихкода, Неопределено - Тип штрихкода
Функция ТипШтрихкода(Штрихкод) Экспорт

    ДлинаШтрихкода = СтрДлина(Штрихкод);

    Если ДлинаШтрихкода = 9 Тогда

        Возврат ПредопределенноеЗначение("Перечисление.ТипШтрихкода.ТШК");

    КонецЕсли;

    Если ДлинаШтрихкода = 129 Тогда

        Возврат ПредопределенноеЗначение("Перечисление.ТипШтрихкода.DataMatrix");

    КонецЕсли;

    Возврат Неопределено;

КонецФункции

#КонецОбласти
